espressif/esp-idf/components/soc/esp32p4/include/soc/i2s_struct.h
/** Group: TX status registers */
/** Type of state register
 *  I2S TX status register
 */
typedef union {
    struct {
        /** tx_idle : RO; bitpos: [0]; default: 1;
         *  1: i2s_tx is idle state. 0: i2s_tx is working.
         */
        uint32_t tx_idle:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} i2s_state_reg_t;


/** Group: ETM registers */
/** Type of etm_conf register
 *  I2S ETM configure register
 */
typedef union {
    struct {
        /** etm_tx_send_word_num : R/W; bitpos: [9:0]; default: 64;
         *  I2S ETM send x words event. When sending word number of
         *  reg_etm_tx_send_word_num[9:0], i2s will trigger an etm event.
         */
        uint32_t etm_tx_send_word_num:10;
        /** etm_rx_receive_word_num : R/W; bitpos: [19:10]; default: 64;
         *  I2S ETM receive x words event. When receiving word number of
         *  reg_etm_rx_receive_word_num[9:0], i2s will trigger an etm event.
         */
        uint32_t etm_rx_receive_word_num:10;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} i2s_etm_conf_reg_t;


/** Group: Sync counter registers */
/** Type of fifo_cnt register
 *  I2S sync counter register
 */
typedef union {
    struct {
        /** tx_fifo_cnt : RO; bitpos: [30:0]; default: 0;
         *  tx fifo counter value.
         */
        uint32_t tx_fifo_cnt:31;
        /** tx_fifo_cnt_rst : WT; bitpos: [31]; default: 0;
         *  Set this bit to reset tx fifo counter.
         */
        uint32_t tx_fifo_cnt_rst:1;
    };
    uint32_t val;
} i2s_fifo_cnt_reg_t;

/** Type of bck_cnt register
 *  I2S sync counter register
 */
typedef union {
    struct {
        /** tx_bck_cnt : RO; bitpos: [30:0]; default: 0;
         *  tx bck counter value.
         */
        uint32_t tx_bck_cnt:31;
        /** tx_bck_cnt_rst : WT; bitpos: [31]; default: 0;
         *  Set this bit to reset tx bck counter.
         */
        uint32_t tx_bck_cnt_rst:1;
    };
    uint32_t val;
} i2s_bck_cnt_reg_t;


/** Group: Clock registers */
/** Type of clk_gate register
 *  Clock gate register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  set this bit to enable clock gate
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} i2s_clk_gate_reg_t;


/** Group: Version register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 36713024;
         *  I2S version control register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} i2s_date_reg_t;


typedef struct {
    uint32_t reserved_000[3];
    volatile i2s_int_raw_reg_t int_raw;
    volatile i2s_int_st_reg_t int_st;
    volatile i2s_int_ena_reg_t int_ena;
    volatile i2s_int_clr_reg_t int_clr;
    uint32_t reserved_01c;
    volatile i2s_rx_conf_reg_t rx_conf;
    volatile i2s_tx_conf_reg_t tx_conf;
    volatile i2s_rx_conf1_reg_t rx_conf1;
    volatile i2s_tx_conf1_reg_t tx_conf1;
    uint32_t reserved_030[4];
    volatile i2s_tx_pcm2pdm_conf_reg_t tx_pcm2pdm_conf;
    volatile i2s_tx_pcm2pdm_conf1_reg_t tx_pcm2pdm_conf1;
    volatile i2s_rx_pdm2pcm_conf_reg_t rx_pdm2pcm_conf;
    uint32_t reserved_04c;
    volatile i2s_rx_tdm_ctrl_reg_t rx_tdm_ctrl;
    volatile i2s_tx_tdm_ctrl_reg_t tx_tdm_ctrl;
    volatile i2s_rx_timing_reg_t rx_timing;
    volatile i2s_tx_timing_reg_t tx_timing;
    volatile i2s_lc_hung_conf_reg_t lc_hung_conf;
    volatile i2s_rxeof_num_reg_t rxeof_num;
    volatile i2s_conf_sigle_data_reg_t conf_sigle_data;
    volatile i2s_state_reg_t state;
    volatile i2s_etm_conf_reg_t etm_conf;
    volatile i2s_fifo_cnt_reg_t fifo_cnt;
    volatile i2s_bck_cnt_reg_t bck_cnt;
    volatile i2s_clk_gate_reg_t clk_gate;
    volatile i2s_date_reg_t date;
} i2s_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(i2s_dev_t) == 0x84, "Invalid size of i2s_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
